{
    "acoustic": "Music that solely or primarily uses instruments which produce sound through entirely acoustic means, as opposed to electric or electronic means.",
    "punk": "A music genre that emerged in the mid-1970s, rooted in garage rock and other forms of what is now known as 'proto-punk' music. Punk rock bands eschewed the perceived excesses of mainstream 1970s rock.",
    "progressive-house": "A subgenre of house music that developed in the early 1990s, characterized by a progressive structure and often featuring long builds and breakdowns.",
    "power-pop": "A style of pop rock that combines the melodic hooks of the Beatles with the energetic performance of the Who.",
    "pop-film": "Music composed specifically for films, encompassing a variety of styles depending on the film's requirements.",
    "pop": "A genre of popular music that is specifically designed to have wide appeal, usually by having catchy hooks, simple beats and melodies, clean production and vocals, and lyrics that usually center on love and romantic relationships.",
    "piano": "Music composed for or performed on the piano, spanning various genres and styles.",
    "party": "Music that is upbeat and energetic, commonly played at social gatherings to encourage dancing and celebration.",
    "pagode": "A Brazilian style of music that originated in Rio de Janeiro as a subgenre of samba, characterized by its use of traditional samba rhythms and instruments.",
    "opera": "A form of theatre in which music has a leading role and the parts are taken by singers, but is distinct from musical theater.",
    "new-age": "A genre of music intended to create artistic inspiration, relaxation, and optimism, often used for yoga, massage, and meditation.",
    "mpb": "Música popular brasileira, a trend in post-bossa nova urban popular music in Brazil that revisits typical Brazilian styles such as samba, samba-canção, and baião.",
    "minimal-techno": "A minimalist subgenre of techno music characterized by a stripped-down aesthetic that exploits the use of repetition and understated development.",
    "metalcore": "A fusion genre blending elements of extreme metal and hardcore punk, known for its heavy guitar riffs, breakdowns, and often melodic choruses.",
    "metal": "A genre of rock music that includes a group of related styles that are intense, virtuosic, and powerful, driven by the aggressive sounds of the distorted electric guitar.",
    "mandopop": "Mandarin popular music, a popular music genre sung in Mandarin Chinese.",
    "malay": "Music originating from the Malay Peninsula, encompassing traditional folk music as well as contemporary styles.",
    "latino": "Music genres from Latin America, encompassing a wide range of styles such as salsa, merengue, and bachata.",
    "latin": "A broad category that includes various styles of music from Latin America, often characterized by rhythms and instruments specific to the region.",
    "kids": "Music specifically composed and performed for children, often educational or entertaining in nature.",
    "k-pop": "A genre of popular music originating from South Korea, characterized by a wide variety of audiovisual elements.",
    "jazz": "A music genre that originated in the African-American communities of New Orleans, characterized by swing and blue notes, call and response vocals, polyrhythms, and improvisation.",
    "j-rock": "Japanese rock music, encompassing various rock genres performed by Japanese artists.",
    "j-pop": "Japanese pop music, a genre that entered the musical mainstream of Japan in the 1990s.",
    "j-idol": "Japanese idol music performed by young entertainers marketed for their image, attractiveness, and personality.",
    "j-dance": "Japanese dance music, encompassing various dance genres performed by Japanese artists.",
    "iranian": "Music originating from Iran, encompassing traditional Persian music as well as contemporary styles.",
    "psych-rock": "A style of rock music that is inspired or influenced by psychedelic culture, attempting to replicate and enhance the mind-altering experiences of psychedelic drugs.",
    "punk-rock": "A rock music genre that emerged in the mid-1970s, characterized by short, fast-paced songs with hard-edged melodies and singing styles, stripped-down instrumentation, and often political, anti-establishment lyrics.",
    "afrobeat": "A music genre that combines West African musical styles with American funk and jazz, characterized by its large-scale ensembles and energetic performances.",
    "r-n-b": "Rhythm and blues, a genre of popular music that originated in African-American communities in the 1940s, characterized by a strong backbeat and emotive vocals.",
    "turkish": "Music originating from Turkey, encompassing traditional Turkish music as well as contemporary styles.",
    "trip-hop": "A genre that originated in the early 1990s in the United Kingdom, characterized by its use of downtempo beats, moody atmospheres, and influences from funk, soul, and jazz.",
    "trance": "A genre of electronic dance music that emerged in the early 1990s, characterized by repetitive melodic phrases and a musical form that builds up and down throughout a track.",
    "techno": "A genre of electronic dance music that emerged in Detroit, Michigan, in the United States during the mid-to-late 1980s, characterized by a repetitive, instrumental sound.",
    "tango": "A style of music that originated among European immigrant populations of Argentina and Uruguay, traditionally played by ensembles including the bandoneon.",
    "synth-pop": "A genre of popular music that uses the synthesizer as the dominant musical instrument, which rose to prominence in the late 1970s and early 1980s.",
    "swedish": "Music originating from Sweden, encompassing traditional Swedish music as well as contemporary styles.",
    "study": "Music designed to aid concentration and focus during study, often instrumental and calming.",
    "spanish": "Music originating from Spain, encompassing traditional Spanish music such as flamenco as well as contemporary styles.",
    "soul": "A genre of African-American popular music that led to many later genres, characterized by its use of gospel-style vocals and emphasis on emotive delivery.",
    "songwriter": "Music composed and performed by the individual who wrote the song, often featuring personal and introspective lyrics.",
    "sleep": "Music designed to aid sleep, often characterized by slow tempos, calming melodies, and minimalistic arrangements.",
    "ska": "A music genre that originated in Jamaica in the late 1950s, combining elements of Caribbean mento and calypso with American jazz and rhythm and blues.",
    "singer-songwriter": "A genre of music where the artist writes, composes, and performs their own musical material, often focusing on personal and introspective themes.",
    "show-tunes": "Songs written for musical theater productions, often characterized by their catchy melodies and lyrics that advance the plot or develop characters.",
    "sertanejo": "A music style from Brazil that evolved from rural folk music, often compared to country music in the United States.",
    "samba": "A Brazilian music genre and dance style, with its roots in Africa via the West African slave trade and African religious traditions.",
    "salsa": "A popular musical style rooted in son Cubano, an Afro-Cuban music genre created by Cuban musicians of Bantu descent. The salsa genre took form in the United States, and it may feature elements from all sorts of Latin American styles.",
    "sad": "Music that conveys melancholic or emotional themes, often with slow tempos and introspective lyrics.",
    "romance": "Music that centers around themes of love and romance, often characterized by soft melodies and sentimental lyrics.",
    "rockabilly": "An early style of rock and roll music that blends elements of country and rhythm and blues, popularized in the 1950s.",
    "rock-n-roll": "A genre of popular music that originated in the 1950s, characterized by a strong rhythm, simple melodies, and an emphasis on electric guitar.",
    "rock": "A broad genre of music that evolved from rock and roll and blues, characterized by the use of electric guitars, strong rhythms, and expressive vocals.",
    "reggaeton": "A genre of Latin American music that blends reggae, dancehall, and Latin rhythms, often featuring rapping and singing over dembow beats.",
    "reggae": "A music genre that originated in Jamaica in the late 1960s, characterized by a steady rhythm and socially conscious lyrics.",
    "industrial": "A genre of music that blends electronic music with elements of rock, metal, and experimental sounds, often featuring dark and mechanical themes.",
    "indie-pop": "A genre of alternative pop music that is often characterized by its DIY ethos, melodic sound, and independent label production.",
    "indie": "A broad genre of music that emphasizes independent production and artistic expression, often incorporating elements from rock, pop, and folk.",
    "indian": "Music originating from India, encompassing a wide range of classical, folk, and contemporary styles.",
    "disney": "Music produced by or associated with Disney movies, often characterized by theatrical, family-friendly compositions and lyrics.",
    "disco": "A genre of dance music that emerged in the 1970s, characterized by four-on-the-floor beats, orchestral arrangements, and groovy basslines.",
    "detroit-techno": "A subgenre of techno music that originated in Detroit in the 1980s, known for its futuristic sounds and mechanical beats.",
    "deep-house": "A subgenre of house music characterized by its smooth, soulful melodies and deep basslines.",
    "death-metal": "An extreme subgenre of heavy metal characterized by fast tempos, deep growling vocals, and complex song structures.",
    "dancehall": "A genre of Jamaican popular music that originated in the late 1970s, characterized by rhythmic vocals and reggae-style beats.",
    "dance": "A broad category of music designed for dancing, typically electronic or pop-based with a strong beat.",
    "country": "A genre of music originating from the Southern United States, characterized by storytelling lyrics, acoustic instruments, and twangy vocals.",
    "comedy": "Music that incorporates humorous elements, often featuring satirical lyrics or comedic storytelling.",
    "club": "Music designed for nightclubs and dance floors, typically electronic or pop-based with high-energy beats.",
    "classical": "A broad genre of music rooted in Western art traditions, typically composed with orchestral arrangements and structured compositions.",
    "chill": "Music that is relaxed and laid-back, often used for unwinding or creating a calm atmosphere.",
    "children": "Music created specifically for young audiences, often featuring simple melodies and educational lyrics.",
    "chicago-house": "A subgenre of house music that emerged in Chicago in the 1980s, characterized by four-on-the-floor rhythms and soulful influences.",
    "cantopop": "A genre of Cantonese pop music that originated in Hong Kong, incorporating elements of Western and Chinese musical styles.",
    "british": "Music originating from the United Kingdom, encompassing various styles such as rock, pop, and electronic music.",
    "breakbeat": "A genre of electronic music that focuses on breakbeats, often used in hip-hop, drum and bass, and jungle music.",
    "brazil": "Music from Brazil, including popular genres such as samba, bossa nova, and forró.",
    "blues": "A music genre originating from African-American communities in the Deep South, characterized by its use of the blues scale and expressive lyrics.",
    "bluegrass": "A genre of American roots music that developed from traditional Appalachian folk, featuring fast tempos and virtuosic instrumental playing.",
    "black-metal": "An extreme subgenre of heavy metal known for its fast tempos, shrieking vocals, and atmospheric, often dark themes.",
    "anime": "Music that is associated with Japanese animated films and television shows, often featuring energetic and catchy compositions.",
    "ambient": "A genre of music that focuses on atmosphere and texture rather than traditional musical structure, often used for relaxation or background soundscapes.",
    "alternative": "A broad genre of music that diverges from mainstream pop and rock, often incorporating experimental or indie elements.",
    "alt-rock": "Alternative rock, a subgenre of rock music that emerged in the 1980s as a response to mainstream rock, often featuring unique and eclectic sounds.",
    "drum-and-bass": "A genre of electronic music characterized by fast breakbeats and heavy basslines, originating from the UK rave scene.",
    "dub": "A subgenre of reggae music that emphasizes instrumental remixes, heavy bass, and reverb effects.",
    "dubstep": "A genre of electronic dance music known for its heavy bass drops, syncopated rhythms, and dark, futuristic sound design.",
    "groove": "Music that emphasizes rhythm and feel, often associated with funk, jazz, and dance-oriented genres.",
    "idm": "Intelligent dance music, a subgenre of electronic music that focuses on complex rhythms and experimental production techniques.",
    "house": "A genre of electronic dance music characterized by repetitive beats, four-on-the-floor rhythms, and synthesized melodies.",
    "honky-tonk": "A subgenre of country music that originated in the Southern United States, known for its piano-driven melodies and lively rhythms.",
    "hip-hop": "A music genre that originated in African-American communities in the 1970s, characterized by rapping, DJing, breakdancing, and graffiti art.",
    "heavy-metal": "A genre of rock music characterized by its loud, aggressive sound, distorted guitars, and powerful vocals.",
    "hardstyle": "A genre of electronic dance music characterized by fast tempos, distorted kicks, and energetic melodies.",
    "hardcore": "A subgenre of punk rock known for its aggressive sound, fast tempos, and politically charged lyrics.",
    "hard-rock": "A genre of rock music that emphasizes heavy guitar riffs, powerful vocals, and high-energy performances.",
    "happy": "Music that is uplifting and positive, often characterized by major keys and energetic rhythms.",
    "guitar": "Music that prominently features the guitar as the primary instrument, spanning multiple genres and styles.",
    "grunge": "A subgenre of alternative rock that emerged in the late 1980s, characterized by distorted guitars, angsty lyrics, and a raw sound.",
    "grindcore": "An extreme genre of music that blends hardcore punk and death metal, characterized by extremely fast tempos and aggressive vocals.",
    "edm": "Electronic dance music, an umbrella term for various styles of electronic music designed for club and festival settings.",
    "goth": "A music genre that emerged from post-punk, characterized by dark, melancholic themes and atmospheric instrumentation.",
    "gospel": "A genre of Christian music that features uplifting lyrics and powerful vocal performances, often associated with African-American religious traditions.",
    "german": "Music originating from Germany, encompassing traditional folk music as well as contemporary pop, rock, and electronic styles.",
    "garage": "A genre of rock music that emerged in the 1960s, characterized by its raw sound and DIY ethos.",
    "funk": "A genre of music that originated in African-American communities in the 1960s, known for its syncopated rhythms and danceable grooves.",
    "french": "Music originating from France, including chanson, electronic, and pop styles.",
    "forro": "A genre of Brazilian music that originated in the Northeast, characterized by accordion-driven melodies and danceable rhythms.",
    "folk": "A broad genre of traditional and contemporary music that is often storytelling-based and acoustically driven.",
    "emo": "A subgenre of punk rock known for its emotional lyrics and melodic instrumentation.",
    "electronic": "A broad genre of music that relies on electronic production techniques and synthesized sounds.",
    "electro": "A subgenre of electronic music that emerged in the 1980s, characterized by drum machines, synthesizers, and robotic vocals.",
    "world-music": "A broad category of music that encompasses traditional and contemporary styles from cultures around the world."
}